app/controllers/changetypes_controller.rb

SELECT "maptolinkedins".* FROM "maptolinkedins"
---
  def index
    @maptolinkedins = Maptolinkedin.all #find_all_by_bluetooth(@myarray)

SELECT "maptolinkedins".* FROM "maptolinkedins" WHERE "maptolinkedins"."linkedinprofile" = 'devikanair' LIMIT 1
UPDATE "maptolinkedins" SET "comment" = 'R', "updated_at" = '2013-10-26 17:00:17.707140' WHERE "maptolinkedins"."id" = 1
---
  def create
    @profile = params[:profile]
    logger.info(@profile)
    @type = params[:comment]
    logger.info(@type)

    @maptolinkedins = Maptolinkedin.find_by_linkedinprofile(@profile)
    @maptolinkedins.comment = @type
    @maptolinkedins.save