app/controllers/mappings_controller.rb

SELECT "maptolinkedins".* FROM "maptolinkedins" WHERE "maptolinkedins"."bluetooth" IN ('DevikasIPhone', 'RamyasAndroid')
---
  def index
    @myarray = ['DevikasIPhone','RamyasAndroid']
    @maptolinkedins = Maptolinkedin.find_all_by_bluetooth(@myarray)

SELECT "maptolinkedins".* FROM "maptolinkedins" WHERE "maptolinkedins"."bluetooth" IN ('DevikasIPhone', 'RamyasAndroid')
---
  def create
    @myarray = params[:bluetooth]

    @arrayofbluetooths = @myarray.split(/,/)
    logger.info(@arrayofbluetooths)
    #@maptolinkedin = Maptolinkedin.new(params[:maptolinkedin])

    #No matter what the params are
    #@myarray = ['DevikasIPhone','RamyasAndroid']
    @maptolinkedins = Maptolinkedin.find_all_by_bluetooth(@arrayofbluetooths)

SELECT "mappings".* FROM "mappings" WHERE "mappings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @mapping = Mapping.find(params[:id])