app/controllers/mappings_controller.rb

  def index
    @maptolinkedins = Maptolinkedin.all
---
SELECT "maptolinkedins".* FROM "maptolinkedins"

  def create
    @myarray = Mapping.new(params[:bluetooth])
    @maptolinkedins = Maptolinkedin.all

    puts myparams
    respond_to do |format|
      if @mapping.save
---
INSERT INTO "mappings" ("bluetooth", "created_at", "linkedinprofile", "updated_at") VALUES (?, ?, ?, ?)  [["bluetooth", "sample"], ["created_at", Sat, 26 Oct 2013 02:42:21 UTC +00:00], ["linkedinprofile", "devikanair"], ["updated_at", Sat, 26 Oct 2013 02:42:21 UTC +00:00]]