app/controllers/maptolinkedins_controller.rb

  def index
    @maptolinkedins = Maptolinkedin.all
---
SELECT "maptolinkedins".* FROM "maptolinkedins"

  def create
    @maptolinkedin = Maptolinkedin.new(params[:maptolinkedin])
    @bluetooth = @maptolinkedin[:bluetooth]
    @allbluetooths = Maptolinkedin.all.collect {|p| p.bluetooth}
    unless @allbluetooths.include? @bluetooth
      respond_to do |format|
      if @maptolinkedin.save
---
SELECT "maptolinkedins".* FROM "maptolinkedins"
INSERT INTO "maptolinkedins" ("bluetooth", "comment", "created_at", "linkedinprofile", "name", "picurl", "profiletitle", "skills", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)