app/controllers/recruiterfilters_controller.rb

SELECT "recruiterfilters".* FROM "recruiterfilters"
---
  def index
    @recruiterfilters = Recruiterfilter.all

SELECT "maptolinkedins".* FROM "maptolinkedins" WHERE "maptolinkedins"."bluetooth" IN ('DevikasIPhone', 'RamyasAndroid')
---
  def create
    @myarray = params[:bluetooth]
    @myfilters = params[:filters]

    @arrayofbluetooths = @myarray.split(/,/)
    logger.info(@arrayofbluetooths)
    #@maptolinkedin = Maptolinkedin.new(params[:maptolinkedin])

    #No matter what the params are
    #@myarray = ['DevikasIPhone','RamyasAndroid']
    @maptolinkedins = Maptolinkedin.find_all_by_bluetooth(@arrayofbluetooths)